USE inha_reserv;

-- Roles
INSERT INTO Roles (name)
VALUES ('student'), ('professor'), ('staff'), ('admin');

-- Departments
INSERT INTO Colleges (name)
VALUES
('공과대학'), ('자연과학대학'), ('경영대학'), ('사범대학'), ('사회과학대학'),
('문과대학'), ('의과대학'), ('예술체육대학'), ('미래융합대학'), ('바이오시스템융합학부'),
('소프트웨어융합대학'), ('간호대학'), ('프런티어창의대학'), ('국제학부');

INSERT INTO Departments (college_id, name)
VALUES
(1, '기계공학과'), (1, '항공우주공학과'), (1, '사회인프라공학과'), (1, '에너지자원공학과'), (1, '조선해양공학과'),
(1, '산업경영공학과'), (1, '화학공학과'), (1, '고분자공학과'), (1, '환경공학과'), (1, '공간정보공학과'),
(1, '건축공학과'), (1, '전기전자공학부'), (1, '신소재공학과'), (1, '반도체시스템공학과'), (1, '이차전지융합학과'),
(1, '융합기술경영학부');

INSERT INTO Departments (college_id, name)
VALUES
(2, '통계학과'), (2, '물리학과'), (2, '수학과'), (2, '화학과'), (2, '해양과학과'), (2, '식품영양학과');

INSERT INTO Departments (college_id, name)
VALUES
(3, '경영학과'), (3, '파이낸스경영학과'), (3, '아태물류학부'), (3, '국제통상학과');

INSERT INTO Departments (college_id, name)
VALUES
(4, '국어교육과'), (4, '영어교육과'), (4, '사회교육과'), (4, '교육학과'), (4, '체육교육과'), (4, '수학교육과');

INSERT INTO Departments (college_id, name)
VALUES
(5, '행정학과'), (5, '정치외교학과'), (5, '미디어커뮤니케이션학과'), (5, '경제학과'), (5, '소비자학과'), (5, '아동심리학과'), (5, '사회복지학과');

INSERT INTO Departments (college_id, name)
VALUES
(6, '한국어문학과'), (6, '사학과'), (6, '철학과'), (6, '중국학과'), (6, '일본언어문화학과'), (6, '문화콘텐츠문화경영학과'), (6, '영미유럽인문융합학부');

INSERT INTO Departments (college_id, name)
VALUES
(7, '의예과'), (7, '의학과');

INSERT INTO Departments (college_id, name)
VALUES
(8, '연극영화학과'), (8, '조형예술학과'), (8, '디자인융합학과'), (8, '스포츠과학과'), (8, '의류디자인학과');

INSERT INTO Departments (college_id, name)
VALUES
(9, '산업경영학과'), (9, '소프트웨어융합공학과'), (9, '메카트로닉스공학과'), (9, '금융투자학과'), (9, '반도체산업융합학과');

INSERT INTO Departments (college_id, name)
VALUES
(10, '생명공학과'), (10, '생명과학과'), (10, '첨단바이오의약학과');

INSERT INTO Departments (college_id, name)
VALUES
(11, '인공지능공학과'), (11, '데이터사이언스학과'), (11, '스마트모빌리티공학과'), (11, '디자인테크놀로지학과'), (11, '컴퓨터공학과');

INSERT INTO Departments (college_id, name)
VALUES
(12, '간호학과');

INSERT INTO Departments (college_id, name)
VALUES
(13, '자유전공융합학부'), (13, '공학융합학부'), (13, '자연과학융합학부'), (13, '경영융합학부'), (13, '사회과학융합학부'), (13, '인문융합학부');

INSERT INTO Departments (college_id, name)
VALUES
(14, 'IBT학과'), (14, 'ISE학과'), (14, 'KLC학과');

-- Users
INSERT INTO Users (email, name, dept_id, phone, role_id)
VALUES
('ai001@inha.ac.kr', '윤준식', 1, '010-1111-2222', 1),
('prof001@inha.ac.kr', '이교수', 2, '010-3333-4444', 2),
('staff001@inha.ac.kr', '박조교', 3, '010-5555-6666', 3);

-- Facilities
INSERT INTO FacilityCategory1 (name)
VALUES ('스터디룸'), ('체육시설'), ('가무연습실'), ('강의실');

INSERT INTO FacilityCategory2 (cat1_id, name)
VALUES
(1, '인문스터디룸'), (1, '해동스터디룸'), (1, '학생라운지스터디룸'),
(2, '운동장'), (2, '테니스장'), (2, '농구장'), (2, '풋살파크'), (2, '피클볼'),
(3, '학생회관403호'), (3, '학생회관404호'), (3, '학생회관406호'),
(4, '5호관'), (4, '하이테크관');

INSERT INTO Facilities (cat2_id, name)
VALUES
-- 인문스터디룸
(1, '인문스터디룸B(5남-032B)'), (1, '인문스터디룸C(5남-032C)'), (1, '인문스터디룸D(5남-032D)'), 
(1, '인문스터디룸E(5남-032E)'), (1, '인문스터디룸F(5남-032F)'),
-- 해동스터디룸
(2, '해동스터디룸A(하-132A)'), (2, '해동스터디룸B(하-132B)'), (2, '해동스터디룸C(하-132C)'),
(2, '해동스터디룸D(하-132D)'), (2, '해동스터디룸E(하-132E)'), (2, '해동스터디룸F(하-132F)'), (2, '해동스터디룸G(하-132G)'),
-- 학생라운지
(3, '학생라운지스터디룸(하-021)'),
-- 운동장
(4, '운동장(축구장)'), (4, '운동장(다목적구장 1(학군단쪽))'), (4, '운동장(다목적구장 2(5남쪽))'),
-- 테니스장
(5, '제1테니스장 3번'), (5, '제1테니스장 4번'), (5, '제1테니스장 5번'),
(5, '제2테니스장 6번'), (5, '제2테니스장 7번'), (5, '제2테니스장 8번'),
-- 농구장
(6, '농구장 1면(야구장쪽에서 첫번째)'), (6, '농구장 2면(야구장쪽에서 두번째)'),
(6, '농구장 3면(야구장쪽에서 세번째)'), (6, '농구장 4면(야구장쪽에서 네번째)'),
-- 풋살파크
(7, '인하풋살파크A'), (7, '인하풋살파크D'),
-- 피클볼
(8, '피클볼 1코트'), (8, '피클볼 2코트(우레탄)'), (8, '피클볼 3코트'),
(8, '피클볼 4코트'), (8, '피클볼 5코트'),
-- 가무연습실
(9, '가무연습실(학생회관403호)'), (10, '가무연습실(학생회관404호)'), (11, '가무연습실(학생회관406호)'),
-- 강의실
(12, '5남-101'), (12, '5남-102'), (12, '5남-201'), (12, '5남-202'),
(13, '하-101'), (13, '하-102'), (13, '하-201'), (13, '하-202');

-- club
INSERT INTO ClubCategory1 (name)
VALUES 
('중앙동아리'), 
('학생회(단과대/전공)'), 
('학생자치기구'), 
('소모임(단과대/전공)'), 
('소모임(대학원)'), 
('기타');

-- 중앙동아리
INSERT INTO ClubCategory2 (cat1_id, name)
VALUES
(1, '공연'), (1, '어학'), (1, '연구'), (1, '사회'), (1, '종교'), (1, '전시'), (1, '무예'), (1, '구기'), (1, '레저'), (1, '봉사');

-- 학생회(단과대/전공)
INSERT INTO ClubCategory2 (cat1_id, name)
VALUES
(2, '공과대학'), (2, '자연과학대학'), (2, '경영대학'), (2, '사범대학'), (2, '사회과학대학'),
(2, '문과대학'), (2, '의과대학'), (2, '예술체육대학'), (2, '미래융합대학'), (2, '바이오시스템융합학부'),
(2, '소프트웨어융합대학'), (2, '간호대학'), (2, '프런티어창의대학'), (2, '국제학부');

-- 학생자치기구
INSERT INTO ClubCategory2 (cat1_id, name)
VALUES
(3, '총학생회'), (3, '총대의원회'), (3, '동아리연합회'), (3, '기록물도서관'), (3, '중앙선거관리위원회');

-- 소모임(대학원)
INSERT INTO ClubCategory2 (cat1_id, name)
VALUES
(5, '일반대학원'), (5, '(특수)공학대학원'), (5, '(특수)경영대학원'), (5, '(특수)교육대학원'),
(5, '(특수)정책대학원'), (5, '(특수)상담심리대학원'), (5, '(특수)보건대학원'),
(5, '(특수)창의글로벌대학원'), (5, '(전문)법학전문대학원'), (5, '(전문)물류전문대학원'),
(5, '(전문)제조혁신전문대학원');

-- 기타
INSERT INTO ClubCategory2 (cat1_id, name)
VALUES
(6, '동문회'), (6, '교내 개인 모임'), (6, '학생사회봉사단 인하랑'), (6, '인하대학교 응원단(ASSESS)'), (6, '중국인유학생회');

-- 중앙동아리(1) → 공연(cat2_id = 1)
INSERT INTO Clubs (cat2_id, name)
VALUES
(1, '개로'), (1, '고전기타회'), (1, '극단 봄'), (1, '꼬망스'), (1, '노래사랑'), (1, '인하오케스트라'), (1, '인다배소리'),
(1, '인하극예술연구회'), (1, '인하인의 피아노 사랑'), (1, '인하합창단'), (1, '트리키'), (1, '판타스틱스테이션'),
(1, '풍물사랑'), (1, 'F.L.EX.'), (1, 'FLAGON'), (1, 'INDKY'), (1, 'POP MUSIC'), (1, '인성');

-- 중앙동아리(1) → 어학(cat2_id = 2)
INSERT INTO Clubs (cat2_id, name)
VALUES
(2, '가이아'), (2, '알파카이'), (2, '인하스피치'), (2, 'AIESEC in INHA'), (2, 'A.L.A'),
(2, 'AZIT'), (2, 'Open Seasame'), (2, 'TIME 연구회');

-- 중앙동아리(1) → 연구(cat2_id = 3)
INSERT INTO Clubs (cat2_id, name)
VALUES
(3, '나래'), (3, '로보트연구회'), (3, '별지기'), (3, '보동보동'), (3, '산하사랑'),
(3, '아이디어 뱅크'), (3, 'INCOM'), (3, '인하공방'), (3, '기우회'), (3, '인하로케트연구회'),
(3, 'GDGoC'), (3, 'I.C.C'), (3, 'IBAS'), (3, 'UMC'), (3, '.NETers');

-- 중앙동아리(1) → 종교(cat2_id = 5)
INSERT INTO Clubs (cat2_id, name)
VALUES
(5, '네비게이토'), (5, 'YWAM 예수전도단'), (5, '민족기독학생회'), (5, '인하대학교 불교학생회'), (5, '인하가톨릭학생회'),
(5, '예수전도단'), (5, 'CAM'), (5, 'CCC'), (5, 'CFM 수화찬양동아리'), (5, 'ESF'), (5, 'IVF'), (5, 'JDM'),
(5, 'JOY선교회'), (5, 'SFC');

-- 중앙동아리(1) → 무예(cat2_id = 7)
INSERT INTO Clubs (cat2_id, name)
VALUES
(7, '검도부'), (7, '바크로바틱소울즈'), (7, 'COMBATE'), (7, '인하대학교 태권도부'), (7, '인하암즈'), (7, '인하유도회'), (7, 'IBF');

-- 중앙동아리(1) → 구기(cat2_id = 8)
INSERT INTO Clubs (cat2_id, name)
VALUES
(8, '라품'), (8, '러브올'), (8, '마농'), (8, 'TEN-X'), (8, '비룡'), (8, '셔틀콕'), (8, 'INHA-WICS'), (8, '인하 FC'),
(8, '에이스리베로'), (8, 'Inha Teal Dragons(인하 미식축구부)'), (8, '테니스부');

-- 중앙동아리(1) → 레저(cat2_id = 9)
INSERT INTO Clubs (cat2_id, name)
VALUES
(9, '인하라이더'), (9, '이카루스'), (9, '탈라리아'), (9, 'SKIN-SCUBA'), (9, '인하대 조정부'), (9, '인하스키부'),
(9, '산악부'),(9, '수영부'), (9, '스노우보드동아리'), (9, '블랙보드'), (9, '인하수중탐사반');

-- 중앙동아리(1) → 봉사(cat2_id = 10)
INSERT INTO Clubs (cat2_id, name)
VALUES
(10, '개구장이'), (10, '대우회/JOA'), (10, '로타랙트'), (10, '멍냥멍냥'), (10, '심성회'),
(10, '아름회'), (10, '아해누리'), (10, '용마루'), (10, '인하브로드'), (10, '인하장학회'),
(10, '트인'), (10, '파파(P.A.P.A)'), (10, '하룡회'), (10, 'MRA'), (10, 'RCY');

-- 공과대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(11, '공과대학 학생회'), (11, '기계공학과 학생회'), (11, '항공우주공학과 학생회'), (11, '사회인프라공학과 학생회'), (11, '에너지자원공학과 학생회'),
(11, '조선해양공학과 학생회'), (11, '산업경영공학과 학생회'), (11, '화학공학과 학생회'), (11, '고분자공학과 학생회'), (11, '환경공학과 학생회'),
(11, '공간정보공학과 학생회'), (11, '건축공학과 학생회'), (11, '전기전자공학부 학생회'), (11, '신소재공학과 학생회'), (11, '반도체시스템공학과 학생회'),
(11, '이차전지융합학과 학생회'), (11, '융합기술경영학부 학생회');

-- 자연과학대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(12, '자연과학대학 학생회'), (12, '통계학과 학생회'), (12, '물리학과 학생회'), (12, '수학과 학생회'), (12, '화학과 학생회'), (12, '해양과학과 학생회'), (12, '식품영양학과 학생회');

-- 경영대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(13, '경영대학 학생회'), (13, '경영학과 학생회'), (13, '파이낸스경영학과 학생회'), (13, '아태물류학부 학생회'), (13, '국제통상학과 학생회');

-- 사범대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(14, '사범대학 학생회'), (14, '국어교육과 학생회'), (14, '영어교육과 학생회'), (14, '사회교육과 학생회'), (14, '교육학과 학생회'), (14, '체육교육과 학생회'), 
(14, '수학교육과 학생회');

-- 사회과학대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(15, '사회과학대학 학생회'), (15, '행정학과 학생회'), (15, '정치외교학과 학생회'), (15, '미디어커뮤니케이션학과 학생회'), (15, '경제학과 학생회'), (15, '소비자학과 학생회'),
(15, '아동심리학과 학생회'), (15, '사회복지학과 학생회');

-- 문과대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(16, '문과대학 학생회'), (16, '일본언어문화학과 학생회'), (16, '문화콘텐츠문화경영학과 학생회'), (16, '사학과 학생회'), (16, '철학과 학생회'),
(16, '한국어문학과 학생회'), (16, '중국학과 학생회'), (16, '영미유럽인문융합학부 학생회');

-- 의과대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(17, '의과대학 학생회'), (17, '의예과 학생회');

-- 예술체육대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(18, '예술체육대학 학생회'), (18, '연극영화학과 학생회'), (18, '조형예술학과 학생회'), (18, '디자인융합학과 학생회'), (18, '스포츠과학과 학생회'), (18, '의류디자인학과 학생회');

-- 공과대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(26, '공과대학 소모임'), (26, '기계공학과 소모임'), (26, '항공우주공학과 소모임'), (26, '사회인프라공학과 소모임'), (26, '에너지자원공학과 소모임'), (26, '조선해양공학과 소모임'),
(26, '산업경영공학과 소모임'), (26, '화학공학과 소모임'), (26, '고분자공학과 소모임'), (26, '환경공학과 소모임'), (26, '공간정보공학과 소모임'), (26, '건축공학과 소모임'),
(26, '전기전자공학부 소모임'), (26, '신소재공학과 소모임'), (26, '반도체시스템공학과 소모임'), (26, '이차전지융합학과 소모임'), (26, '융합기술경영학부 소모임');

-- 자연과학대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(27, '자연과학대학 소모임'), (27, '통계학과 소모임'), (27, '물리학과 소모임'), (27, '수학과 소모임'), (27, '화학과 소모임'), (27, '해양과학과 소모임'), (27, '식품영양학과 소모임');

-- 경영대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(28, '경영대학 소모임'), (28, '경영학과 소모임'), (28, '파이낸스경영학과 소모임'), (28, '아태물류학부 소모임'), (28, '국제통상학과 소모임');

-- 사범대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(29, '사범대학 소모임'), (29, '국어교육과 소모임'), (29, '영어교육과 소모임'), (29, '사회교육과 소모임'), (29, '교육학과 소모임'), (29, '체육교육과 소모임'),
(29, '수학교육과 소모임');

-- 사회과학대학
INSERT INTO Clubs (cat2_id, name)
VALUES
(30, '사회과학대학 소모임'), (30, '행정학과 소모임'), (30, '정치외교학과 소모임'), (30, '미디어커뮤니케이션학과 소모임'), (30, '경제학과 소모임'), (30, '소비자학과 소모임'),
(30, '아동심리학과 소모임'), (30, '사회복지학과 소모임');

-- 학생자치기구는 중분류 그대로 사용
INSERT INTO Clubs (cat2_id, name)
VALUES
(41, '총학생회'), (42, '총대의원회'), (43, '동아리연합회'), (44, '기록물도서관'), (45, '중앙선거관리위원회');



-- Reservations
INSERT INTO Reservations 
(user_id, facility_id, group_name, event_name, message, start_time, end_time, hvac_mode)
VALUES
(1, 2, 'SINSA 인공지능학회', '머신러닝 스터디', '빔프로젝터 사용 요청', '2025-11-01 14:00:00', '2025-11-01 17:00:00', 'cool');

INSERT INTO Reservations 
(user_id, facility_id, group_name, event_name, start_time, end_time, approval_1)
VALUES
(2, 3, '컴공 축구동아리', '정기 친선 경기', '2025-11-03 10:00:00', '2025-11-03 12:00:00', 'approved');
